Repository: mokhaled12345678/JoudAcademy
Catalog: Locale/*/LC_MESSAGES/django.po
Languages: ar

source: Home
ar: الصفحة الئيسية

source: Courses
ar: الدورات

source: FAQ
ar: الأسئلة

source: Registration and Fees
ar: التسجيل والرسوم

source: About Us
ar: عنا

source: Contact Us
ar: تواصل معنا

source: How effective is online learning in comparison to in-class learning?
ar: ما مدى فعالية التعلم عبر الإنترنت مقارنة بالتعلم داخل الفصل؟

source: Online courses offer more flexibility and
ar: توفر الدورات عبر الإنترنت المزيد من المرونة و

source: are ideal for people with a busy schedule
ar: مثالية للأشخاص الذين لديهم جدول أعمال مزدحم

source: while in-class education traditionally
ar: بينما التعليم في الصف تقليديا

source: has a more structured class schedule
ar: لديه جدول زمني أكثر تنظيما

source: Some students may feel shy or intimidated in front of their peers
ar: قد يشعر بعض الطلاب بالخجل أو الخوف أمام أقرانهم

source: compared to the online environment.
ar: مقارنة ببيئة الانترنت.

source: The most noted advantages for each method have been identified: Online
ar: وقد تم تحديد المزايا الأكثر ملاحظة لكل طريقة: عبر الإنترنت

source: Convenience and flexibility
ar: الراحة والمرونة

source: The individual is the focus
ar: الفرد هو التركيز

source: Global reach: anytime, anyplace conversations
ar: الوصول العالمي: المحادثات في أي وقت وفي أي مكان

source: Teaches self-motivation and self-discipline In-Class
ar: يعلم الدافع الذاتي والانضباط الذاتي في الصف

source: Security of a longer-standing format.
ar: أمان التنسيق طويل الأمد.

source: More real face-to-face interaction
ar: المزيد من التفاعل الحقيقي وجهًا لوجه

source: on-campus clubs and extracurricular activities.
ar: الأندية داخل الحرم الجامعي والأنشطة اللامنهجية.

source: Hands-on training for some professions.
ar: التدريب العملي على بعض المهن.

source: What is online Quran teaching?
ar: ما هو تعليم القرآن الكريم عبر الإنترنت؟

source: It is a 1 on 1 live web based meeting
ar: إنه اجتماع مباشر على شبكة الإنترنت 1 في 1

source: with telecommunication application
ar: مع تطبيق الاتصالات

source: that provides internet voice calls and
ar: الذي يوفر المكالمات الصوتية عبر الإنترنت و

source: screen sharing between computers
ar: مشاركة الشاشة بين أجهزة الكمبيوتر

source: tablets and mobile devices
ar: الأجهزة اللوحية والأجهزة المحمولة.

source: It enables students to interact with real life teachers
ar: أنها تمكن الطلاب من التفاعل مع المعلمين الحياة الحقيقية

source: from any computer with internet access
ar: من أي جهاز كمبيوتر متصل بالإنترنت.

source: By providing a human touch to islamic education
ar: من خلال توفير لمسة إنسانية للتعليم الإسلامي

source: we guide students personally in order to
ar: نحن نرشد الطلاب شخصيًا من أجل

source: learn The Holy Quran effectively
ar: تعلم القرآن الكريم بفعالية

source: whilst providing an online learning experience
ar: مع توفير تجربة التعلم عبر الإنترنت

source: through online interactive technology
ar: من خلال التكنولوجيا التفاعلية عبر الإنترنت

source: How quickly student can start?
ar: ما مدى سرعة الطالب في البدء؟

source: We will start offering our classes , In Shaa Allah
ar: سنبدأ بتقديم دروسنا إن شاء الله

source: Whence you apply you will be able to enroll for classes
ar: من حيث يمكنك التقديم، سوف تكون قادرًا على التسجيل في الفصول الدراسية

source: within a week of getting accepted
ar: خلال أسبوع من الحصول على القبول

source: Get access to high quality learning!
ar: أحصل علي وصول الي جودة تعليم عالية

source: Join online courses
ar: إنضم الي الدورات الأونلاين

source: today
ar: اليوم

source: Flexibility and ideal for people with a busy schedule.
ar: المرونة ومثالية للأشخاص الذين لديهم جدول أعمال مزدحم.

source: A 1 on 1 live web based meeting with telecommunication application that
ar: اجتماع مباشر على شبكة الإنترنت 1 في 1 مع تطبيق الاتصالات الذي

source: provides internet voice calls and screen sharing between computers,
ar: يوفر المكالمات الصوتية عبر الإنترنت ومشاركة الشاشة بين أجهزة الكمبيوتر،

source: tablets and mobile devices.
ar: الأجهزة اللوحية والأجهزة المحمولة.

source: It enables students to interact with real life teachers
ar: أنها تمكن الطلاب من التفاعل مع المعلمين الحياة الحقيقية

source: from any computer with internet access.
ar: من أي جهاز كمبيوتر متصل بالإنترنت.

source: With us you can learn * Basic Noorani Qaida Course
ar: معنا يمكنك أن تتعلم * دورة القاعدة النورانية الأساسية

source: Tajweed Al-Quran & makharij Al-Huroof
ar: تجويد القرآن ومخارج الحروف

source: Quran memorization
ar: حفظ القرآن

source: Reading with Tilawat
ar: القراءة مع تلاوات

source: Reading with Tarteel
ar: القراءة مع ترتيل

source: Sanad Riwayah Hafs An Asim By the way of Shatibiyah
ar: سند رواية حفص عن عاصم من طريق الشاطبية

source: Sanad Al-Qira’at Al-Ashir Al-Sofhra By the way of Shatibiyah
ar: سند القراءات العاشر الصفراء من طريق الشاطبية

source: Tuhfat Ul-Atfaal & Al-Jazriah
ar: تحفة الاطفال والجزرية

source: Tuhfat Al-Shatibih
ar: تحفه الشاطبيه

source: Quran for non-Arabic speaking
ar: القرآن الكريم لغير الناطقين بالعربية

source: Islamic study for kids
ar: الدراسة الإسلامية للأطفال

source: Islamic study for adults
ar: الدراسات الإسلامية للكبار

source: Tahfeez Quran
ar: تحفيظ القرآن

source: Behave Your Brain
ar: إهتم بعقلك

source: Soul Today
ar: روح اليوم

source: Memorizing the Quran is the best you can do!
ar: حفظ القرآن هو افضل ما يمكنك القيام به

source: You will be rewarded the ten good deeds for every single letter
ar: لك بكل حرف عشر حسنات

source: of the Quran you will read and memorize
ar: من القرآن سوف تقرأه وتحفظه

source: If you would like your ethics to be like the Prophets,
ar: إذا أردت أن تكون أخلاقك مثل النبي

source: you have to memorize the Quran.
ar: عليك بحفظ القرآن.

source: All the stories of the successors
ar: كل قصص الخلفاء

source: and ancestors are preserved in the Quran.
ar: والأجداد محفوظون في القرآن.

source: Learn to enjoy
ar: تعلم ان تستمتع

source: every minute of your life.
ar: بكل دقيقة في حياتك

source: Online
ar: اونلاين

source: Learning
ar: تعلم

source: Seven Benefits of Online Learning
ar: سبع فوائد للتعلم عبر الانترنت

source: Added Flexibility and Self-Paced Learning.
ar: مرونة وتعلم بوتيرة ذاتية

source: Better Time Management.
ar: تحسين ادارة الوقت

source: Demonstrated Self-Motivation.
ar: تعزيز التحفيز الذاتي المبديه

source: Improved Virtual Communication and Collaboration
ar: تحسين التواصل الافتراضي والتعاون

source: A Broader, Global Perspective.
ar: نظرة ثقافيه وعالمية اوسع

source: Refined Critical-thinking Skills.
ar: تحسين مهارات التفكير النقدي

source: New Technical Skills.
ar: مهارات تقنية جديدة

source: Course Objectives:
ar: اهداف الدورة

source: Course Requirements:
ar: متطلبات الدورة

source: After Complete This Course:
ar: بعد إتمام هذه الدورة

source: Course Structure
ar: هيكل الدورة

source: Class Type
ar: نوع الحصة

source: Class Duration
ar: مدة الحصة

source: Age Level
ar: المستوي العمري

source: Course Level
ar: مستوي الدورة

source: Course Period
ar: مدة الدورة

source: Tutor
ar: مدرس شخصي

source: Gender
ar: الجنس

source: Male/Female
ar: ذكر\انثي

source: Languages
ar: اللغات

source: Arabic/English
ar: عربي\إنجليزي
